software/git/multi-host-git-config.org
#+TITLE: 여러 호스트에서 git을 사용할 때의 설정 방법

* 개요
한 대의 로컬 컴퓨터에서 여러 개의 git 호스트를 접근할 때 필요한 설정 방법에 대해서 다룬다. 

예를 들면 github.com 의 저장소도 사용할 필요가 있고, gitlab.com 의 저장소도 사용할 필요가 있는 경우다. 

* 설정
*기존에 사용하고 있던 git호스트(github) 유저 정보와 추가로 사용하려고 하는 git 호스트의 유저정보가 완전히 동일하다면 아래의 설정은 필요가 없을 것이다.*

필자의 경우는 서로 다른 이메일 계정을 사용하고 싶으므로 아래의 설정을 추가하였다. 

** 새로운 유저 추가
필자의 경우 github.com 의 유저정보를 global-user로 설정하고, 새로운 git호스트는 local-user로 설정해서 쓰기로 했다.  

때문에, 새로운 git호스트에서 또 새로운 repo를 만들 경우 귀찮지만 매번 유저정보를 지정해주어야 한다. (더 좋은 방법이 있으면 알려주기 바람)

local-user를 추가하는 방법은 다음과 같다. 

#+BEGIN_SRC bash
cd [repository-path]
git config user.name "Your Name Here"
git config user.email your@email.com
#+END_SRC

** 새로운 ssh-key 생성
키 생성과정은 github를 이용할 때 SSH 키를 만들었던 과정과 동일하다. 

다만 키가 저장되는 위치를 global-user의 키와 겹치지 않게 별도 경로를 지정하도록 한다.

#+BEGIN_SRC bash
ssh-keygen -t rsa -C "your@email.com"
#+END_SRC

** ssh-key 의 위치 설정
git호스트별로 사용하는 계정이 다르기 때문에 사용하고자 하는 키도 각기 다른 것을 사용하도록 설정해야 한다. 

~/.ssh/config 파일을 만들고 다음 내용을 참고해서 추가한다. 

#+BEGIN_SRC bash
Host github.com
 IdentityFile ~/.ssh/id_rsa
Host [new-git-host-address]
 IdentityFile [new-git-host-key-path]
#+END_SRC



* 참고
https://stackoverflow.com/questions/5323778/setting-a-custom-path-for-git-private-ssh-key-on-linux
https://stackoverflow.com/questions/4220416/can-i-specify-multiple-users-for-myself-in-gitconfig
