software/git/multi-host-git-config.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>여러 호스트에서 git을 사용할 때의 설정 방법</title>
<!-- 2018-05-09 수 12:51 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">여러 호스트에서 git을 사용할 때의 설정 방법</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 개요</a></li>
<li><a href="#sec-2">2. 설정</a>
<ul>
<li><a href="#sec-2-1">2.1. 새로운 유저 추가</a></li>
<li><a href="#sec-2-2">2.2. 새로운 ssh-key 생성</a></li>
<li><a href="#sec-2-3">2.3. ssh-key 의 위치 설정</a></li>
</ul>
</li>
<li><a href="#sec-3">3. 참고</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 개요</h2>
<div class="outline-text-2" id="text-1">
<p>
한 대의 로컬 컴퓨터에서 여러 개의 git 호스트를 접근할 때 필요한 설정 방법에 대해서 다룬다. 
</p>

<p>
예를 들면 github.com 의 저장소도 사용할 필요가 있고, gitlab.com 의 저장소도 사용할 필요가 있는 경우다. 
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 설정</h2>
<div class="outline-text-2" id="text-2">
<p>
<b>기존에 사용하고 있던 git호스트(github) 유저 정보와 추가로 사용하려고 하는 git 호스트의 유저정보가 완전히 동일하다면 아래의 설정은 필요가 없을 것이다.</b>
</p>

<p>
필자의 경우는 서로 다른 이메일 계정을 사용하고 싶으므로 아래의 설정을 추가하였다. 
</p>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 새로운 유저 추가</h3>
<div class="outline-text-3" id="text-2-1">
<p>
필자의 경우 github.com 의 유저정보를 global-user로 설정하고, 새로운 git호스트는 local-user로 설정해서 쓰기로 했다.  
</p>

<p>
때문에, 새로운 git호스트에서 또 새로운 repo를 만들 경우 귀찮지만 매번 유저정보를 지정해주어야 한다. (더 좋은 방법이 있으면 알려주기 바람)
</p>

<p>
local-user를 추가하는 방법은 다음과 같다. 
</p>

<div class="org-src-container">

<pre class="src src-bash">cd [repository-path]
git config user.name "Your Name Here"
git config user.email your@email.com
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 새로운 ssh-key 생성</h3>
<div class="outline-text-3" id="text-2-2">
<p>
키 생성과정은 github를 이용할 때 SSH 키를 만들었던 과정과 동일하다. 
</p>

<p>
다만 키가 저장되는 위치를 global-user의 키와 겹치지 않게 별도 경로를 지정하도록 한다.
</p>

<div class="org-src-container">

<pre class="src src-bash">ssh-keygen -t rsa -C "your@email.com"
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> ssh-key 의 위치 설정</h3>
<div class="outline-text-3" id="text-2-3">
<p>
git호스트별로 사용하는 계정이 다르기 때문에 사용하고자 하는 키도 각기 다른 것을 사용하도록 설정해야 한다. 
</p>

<p>
~/.ssh/config 파일을 만들고 다음 내용을 참고해서 추가한다. 
</p>

<div class="org-src-container">

<pre class="src src-bash">Host github.com
 IdentityFile ~/.ssh/id_rsa
Host [new-git-host-address]
 IdentityFile [new-git-host-key-path]
</pre>
</div>
</div>
</div>
</div>



<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 참고</h2>
<div class="outline-text-2" id="text-3">
<p>
<a href="https://stackoverflow.com/questions/5323778/setting-a-custom-path-for-git-private-ssh-key-on-linux">https://stackoverflow.com/questions/5323778/setting-a-custom-path-for-git-private-ssh-key-on-linux</a>
<a href="https://stackoverflow.com/questions/4220416/can-i-specify-multiple-users-for-myself-in-gitconfig">https://stackoverflow.com/questions/4220416/can-i-specify-multiple-users-for-myself-in-gitconfig</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2018-05-09 수 12:51</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
